ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
    public function admin_index()
    {
            $title = 'Daftar Artikel';
            $q = $this->request->getVar('q') ?? '';
            $model = new ArtikelModel();
            $data = [
                'title' => $title,
                            'q' => $q,
                            'artikel' => $model->like('judul', $q)->paginate(10), # data dibatasi 10 record per halaman

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Artikel Pertamka', 'Lorem Ipsum adalah contoh teks atau dummy dalam industri percetakan dan penataan huruf atau typesetting. Lorem Ipsum telah menjadi standar contoh teks sejak tahun 1500an, saat seorang tukang cetak yang tidak dikenal mengambil sebuah kumpulan teks dan mengacaknya untuk menjadi sebuah buku contoh huruf.', 'Artikel-Pertamka', 'IMG-20190610-WA0040.jpg')
---
    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'gambar' => $file->getName(),
            ]);